# FormattedText Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText Constructor
FormattedText Class See Also
---
Creates a new default FormattedText object, which contains only a carriage return character and has no formatting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public FormattedText()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FormattedText()
```

# See Also
FormattedText Class
FormattedText Overload
Autodesk.Revit.DB Namespace